export default function GeographyPage() {
  return (
    <main
      className="
                  flex
                  justify-center
                  content-center
                  "
    >
      <img
        src="src/assets/3.jpg"
        className="
                    h-full
                    w-[60%]
                    object-contain
                    object-center
                    rounded-full
                    "
      />
      <div
        className="
                    h-full
                    w-[40%]
                    py-10
                    px-4
                    text-white
                    flex
                    flex-col
                    content-center
                    justify-center
                    text-justify
                    "
      >
        Одеса розташована на північно-західному узбережжі Чорного моря, на
        перетині шляхів з Північної та Центральної Європи на Близький Схід та в
        Азію, у центрі Одеського району однойменної області. Місто перебуває у
        східноєвропейському часовому поясі. Площа міста сягає 162,42 км².
        Джерела питної води на території міста нині — це бюветні комплекси, а
        також централізоване постачання водою Одеси та прилеглих околиць
        підприємством Інфоксводоканал, що здійснюється з річки Дністер по
        40-кілометровому водогону через водозабір у місті Біляївка. Поблизу
        міста лежать три великих лимани: Куяльницький, Хаджибейський та Сухий.
        Місто розташоване на відстані близько 39 км від кордону з Молдовою.
        Зокрема, саме така відстань між Одесою та пунктом пропуску через
        державний кордон України «Маяки-Удобне». Одеса розташована у
        Причорноморській низовині. Середня висота міста над рівнем моря — 50 м.
        Найвища точка Одеси — Жевахова гора (65 м над рівнем моря), а найнижча —
        Куяльницький лиман (4,2 м нижче рівня моря).
      </div>
    </main>
  );
}
