export default function HistoryPage() {
  return (
    <main
      className="
            flex
            justify-center
            content-center
            "
    >
      <div
        className="
              h-full
              w-[40%]
              py-10
              px-4
              text-white
              flex
              flex-col
              content-center
              justify-center
              text-justify
              "
      >
        Дата 22 серпня (за новим стилем 2 вересня) 1794 року озвучена істориком
        Аполлоном Скальковським у книзі «Первое тридцатилетие истории Одессы»
        1837 року як день, коли відбулося освячення перших одеських храмів.
        1849 року цей день почали офіційно відзначати офіційно, проводячи хресні
        ходи. Відтоді цей день відзначався офіційно як день міста. 1794 рік
        зазначений як дата заснування Одеси на ювілейній монеті 2014 року (та
        аналогічній срібній монеті). На державному рівні дата була переглянута
        11 лютого 2015 року з прийняттям Верховною Радою України постанови «Про
        відзначення пам'ятних дат і ювілеїв у 2015 році», якою датою заснування
        Одеси зазначається 1415 рік. У постанові КМУ «Про затвердження
        Списку історичних населених місць України» від 26 липня 2001 року роком
        заснування Одеси зазначений 1794. Протиріччя між вказаними
        постановами КМУ та Верховної ради стали предметом судового розгляду.
        Офіційне святкування дня міста 2 вересня продовжується після 2015 року
        на місцевому та державному рівні
      </div>
      <img
        src="src/assets/4.jpg"
        className="
              h-full
              w-[60%]
              object-contain
              object-center
              rounded-full
              "
      />
    </main>
  );
}
