export default function NamePage() {
  return (
    <main
      className="
              flex
              justify-center
              content-center
              "
    >
      <div
        className="
                h-full
                w-[40%]
                py-10
                px-4
                text-white
                flex
                flex-col
                content-center
                justify-center
                text-justify
                "
      >
        Одеса — сучасна українська назва, від 1795
        року. Уперше назва Одеса з'явилася 10 (21) січня 1795 року.
        Назва може бути пов'язана з давньогрецькою колонією Одесо́с (грец.
        Οδησσός; нині встановлено, що колонія є на місці міста Варна).
        Наприкінці XVIII століття була мода називати міста грецькими іменами,
        пов'язана з «Грецьким проєктом» Катерини II (наприклад, Ольвіополь,
        Севастополь, Сімферополь, Тирасполь тощо). Аде́с — стара українська
        назва. Коцюбіїв — литовська назва до XVI століття. Наприкінці XIV —
        початку XV століття північно-західне Причорномор'я перейшло під владу
        Великого князівства Литовського, це пов'язано з іменем польського
        шляхтича Кочуби Якушинського. Точна дата появи поселення невідома, а
        назви в різний час та в різних джерелах відрізняються, наприклад:
        Кочубїїв, Качубїїв, Качубий, Качибей, Хаджибей, Гаджибей, Аджибей.
        Перша письмова згадка про порт Коцюбіїв (in portu … Kaczubyeiow)
        Великого князівства Литовського і Руського, датується 19 травня 1415
        року у польського хроніста Яна Длугоша. Хаджибе́й (з османської:
        «той, що здійснив хадж») — назва до 1795 року. Істріан — ймовірна назва
        у VI—III століттях до н. е. Місто має багато «народних назв».
        Поширеною є «Одеса-мама», що має відношення до кримінального
        світу. Час від часу вживаються такі порівняння, назви та
        словосполучення, як «Перлина Чорного моря», «Південна Пальміра» (у
        порівнянні з Пальмірою — містом дивовижної краси; відносно сирійської
        Пальміри. Одеса насправді розташована північніше, проте, відповідно до
        російського імперського наративу, «Північна Пальміра» — це
        Санкт-Петербург), «Південна столиця», «Столиця гумору» тощо.
      </div>
      <img
        src="src/assets/2.jpeg"
        className="
                h-full
                w-[60%]
                object-contain
                object-center
                rounded-full
                "
      />
    </main>
  );
}
